case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "1";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1.23 0 0);

boundaryField
{
    walls
    {
        type            noSlip;
    }
    inlet
    {
        type            interstitialInletVelocity;
        inletVelocity   uniform (1.23 0 0);
        value           uniform (1.23 0 0);
        phi             alphaRhoPhi;
        alpha           alpha;
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        phi             alphaRhoPhi;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
