case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          324;
        startFace       30564;
    }
    outlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          324;
        startFace       30888;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2376;
        startFace       31212;
    }
)

// ************************************************************************* //
