case/constant/steelCloudPositions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    location    "";
    class       vectorField;
    object      steelCloudPositions;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
(
(0.006 0.006 0.006)
(0.006 0.018 0.006)
(0.006 0.03 0.006)
(0.006 0.042 0.006)
(0.006 0.054 0.006)
(0.006 0.066 0.006)
(0.006 0.006 0.018)
(0.006 0.018 0.018)
(0.006 0.03 0.018)
(0.006 0.042 0.018)
(0.006 0.054 0.018)
(0.006 0.066 0.018)
(0.006 0.006 0.03)
(0.006 0.018 0.03)
(0.006 0.03 0.03)
(0.006 0.042 0.03)
(0.006 0.054 0.03)
(0.006 0.066 0.03)
(0.006 0.006 0.042)
(0.006 0.018 0.042)
(0.006 0.03 0.042)
(0.006 0.042 0.042)
(0.006 0.054 0.042)
(0.006 0.066 0.042)
(0.006 0.006 0.054)
(0.006 0.018 0.054)
(0.006 0.03 0.054)
(0.006 0.042 0.054)
(0.006 0.054 0.054)
(0.006 0.066 0.054)
(0.006 0.006 0.066)
(0.006 0.018 0.066)
(0.006 0.03 0.066)
(0.006 0.042 0.066)
(0.006 0.054 0.066)
(0.006 0.066 0.066)
(0.018 0.006 0.006)
(0.018 0.018 0.006)
(0.018 0.03 0.006)
(0.018 0.042 0.006)
(0.018 0.054 0.006)
(0.018 0.066 0.006)
(0.018 0.006 0.018)
(0.018 0.018 0.018)
(0.018 0.03 0.018)
(0.018 0.042 0.018)
(0.018 0.054 0.018)
(0.018 0.066 0.018)
(0.018 0.006 0.03)
(0.018 0.018 0.03)
(0.018 0.03 0.03)
(0.018 0.042 0.03)
(0.018 0.054 0.03)
(0.018 0.066 0.03)
(0.018 0.006 0.042)
(0.018 0.018 0.042)
(0.018 0.03 0.042)
(0.018 0.042 0.042)
(0.018 0.054 0.042)
(0.018 0.066 0.042)
(0.018 0.006 0.054)
(0.018 0.018 0.054)
(0.018 0.03 0.054)
(0.018 0.042 0.054)
(0.018 0.054 0.054)
(0.018 0.066 0.054)
(0.018 0.006 0.066)
(0.018 0.018 0.066)
(0.018 0.03 0.066)
(0.018 0.042 0.066)
(0.018 0.054 0.066)
(0.018 0.066 0.066)
(0.03 0.006 0.006)
(0.03 0.018 0.006)
(0.03 0.03 0.006)
(0.03 0.042 0.006)
(0.03 0.054 0.006)
(0.03 0.066 0.006)
(0.03 0.006 0.018)
(0.03 0.018 0.018)
(0.03 0.03 0.018)
(0.03 0.042 0.018)
(0.03 0.054 0.018)
(0.03 0.066 0.018)
(0.03 0.006 0.03)
(0.03 0.018 0.03)
(0.03 0.03 0.03)
(0.03 0.042 0.03)
(0.03 0.054 0.03)
(0.03 0.066 0.03)
(0.03 0.006 0.042)
(0.03 0.018 0.042)
(0.03 0.03 0.042)
(0.03 0.042 0.042)
(0.03 0.054 0.042)
(0.03 0.066 0.042)
(0.03 0.006 0.054)
(0.03 0.018 0.054)
(0.03 0.03 0.054)
...
)
// ************************************************************************* //
