case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0 0 0)
    (0 72 0)
    (0 72 72)
    (0 0 72)
    (132 0 0)
    (132 72 0)
    (132 72 72)
    (132 0 72)
);

blocks
(
    // hex (0 1 2 3 4 5 6 7) (1 15 45) simpleGrading (1 1 1)
    hex (0 1 2 3 4 5 6 7) (18 18 33) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
    
    outlet
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (2 3 7 6)
            (1 2 6 5)
            (0 3 7 4)
        );
    }

);

// ************************************************************************* //
