case/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name heatingCells;
        type cellSet;
        action new;

        source  boxToCell;
        sourceInfo
        {
            box (-0.065 -0.065 0.057) (0.065 0.065 0.1);
        }
    }
    
    {
        name ignitionCells;
        type cellSet;
        action new;

        source  boxToCell;
        sourceInfo
        {
            box (-0.065 -0.065 0.057) (0.065 0.065 0.1);
        }
    }
);


// ************************************************************************* //
